Student DB: Create a PANDAS dataframe for a university database holding student information

The database should contain the student's ID, name, field of study and number of semesters

Print your data frame

In [19]:
import pandas as pd

students = [['Peter', 'information science', 4], 
            ['Maria', 'computer science', 3], 
            ['Bob', 'design', 6]]

df = pd.DataFrame(students, index=['ID1', 'ID2', 'ID3'], columns=['name', 'field of study', 'semester'])
df

      name       field of study  semester
ID1  Peter  information science         4
ID2  Maria     computer science         3
ID3    Bob               design         6

Perform the following operations on your data frame and check the result:
- Select columns "ID" and "Name"
- Create a new column adding one semester to the existing number of semesters
- Permanently drop the new column again

In [20]:
df[['name']]

      name
ID1  Peter
ID2  Maria
ID3    Bob

In [21]:
df['semester + 1'] = df['semester'] + 1
df

      name       field of study  semester  semester + 1
ID1  Peter  information science         4             5
ID2  Maria     computer science         3             4
ID3    Bob               design         6             7

In [22]:
df.drop('semester + 1', axis=1, inplace=True)
df

      name       field of study  semester
ID1  Peter  information science         4
ID2  Maria     computer science         3
ID3    Bob               design         6

Perform the following operations on your data frame and check the result:
- Select all columns for one specific student
- Show the name of all students in a specific semester (without directly selecting one row)

In [28]:
df.loc[['ID1']]

      name       field of study  semester
ID1  Peter  information science         4

In [33]:
df[df['semester'] == 3]

      name    field of study  semester
ID2  Maria  computer science         3